
### :heavy_check_mark: Terraform Format and Style 🎨
<details><summary>Logs</summary>
Output
```diff

```
Errors
```

```
</details> <!-- End Format Logs -->
### :heavy_check_mark: Terraform Initialization ⚙️
<details><summary>Logs</summary>
Output
```

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Finding hashicorp/aws versions matching "~> 3.66.0"...
- Installing hashicorp/aws v3.66.0...
- Installed hashicorp/aws v3.66.0 (signed by HashiCorp)

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m

```
Errors
```

```
</details> <!-- End Init Logs -->
### :heavy_check_mark: Terraform Validation 🤖
<details><summary>Logs</summary>
Output
```+
Success! The configuration is valid.


```
Errors
```

```
</details> <!-- End Validate Logs -->
### :heavy_check_mark: Terraform Plan 📖
<details><summary>Logs</summary>
```terraform
Acquiring state lock. This may take a few moments...
aws_iam_role.aws-elasticbeanstalk-ec2-role: Refreshing state... [id=aws-elasticbeanstalk-ec2-role]
aws_s3_bucket.bucket-s3-app: Refreshing state... [id=image-manager-app-file]
aws_elastic_beanstalk_application.tftest: Refreshing state... [id=ImageManager]
aws_iam_policy_attachment.aws-elasticbeanstalk-ec2-attach-SSM: Refreshing state... [id=test-attachment-1]
aws_iam_instance_profile.aws-elasticbeanstalk-ec2-instance-profile: Refreshing state... [id=aws-elasticbeanstalk-ec2-instance-profile]
aws_iam_policy_attachment.aws-elasticbeanstalk-ec2-attach-EB: Refreshing state... [id=test-attachment-1]
aws_iam_policy_attachment.aws-elasticbeanstalk-ec2-attach-EC2: Refreshing state... [id=test-attachment-1]
aws_iam_policy_attachment.aws-elasticbeanstalk-ec2-attach-S3: Refreshing state... [id=test-attachment-1]
aws_elastic_beanstalk_environment.tfenvtest: Refreshing state... [id=e-pcakmbrskh]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_iam_policy_attachment.aws-elasticbeanstalk-ec2-attach-EB has been changed
  ~ resource "aws_iam_policy_attachment" "aws-elasticbeanstalk-ec2-attach-EB" {
      + groups     = []
        id         = "test-attachment-1"
        name       = "test-attachment-1"
      + users      = []
        # (2 unchanged attributes hidden)
    }
  # aws_s3_bucket.bucket-s3-app has been changed
  ~ resource "aws_s3_bucket" "bucket-s3-app" {
        id                          = "image-manager-app-file"
      + tags                        = {}
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # aws_elastic_beanstalk_application.tftest has been changed
  ~ resource "aws_elastic_beanstalk_application" "tftest" {
        id          = "ImageManager"
        name        = "ImageManager"
      + tags        = {}
        # (3 unchanged attributes hidden)
    }
  # aws_iam_instance_profile.aws-elasticbeanstalk-ec2-instance-profile has been changed
  ~ resource "aws_iam_instance_profile" "aws-elasticbeanstalk-ec2-instance-profile" {
        id          = "aws-elasticbeanstalk-ec2-instance-profile"
        name        = "aws-elasticbeanstalk-ec2-instance-profile"
      + tags        = {}
        # (6 unchanged attributes hidden)
    }
  # aws_iam_policy_attachment.aws-elasticbeanstalk-ec2-attach-EC2 has been changed
  ~ resource "aws_iam_policy_attachment" "aws-elasticbeanstalk-ec2-attach-EC2" {
      + groups     = []
        id         = "test-attachment-1"
        name       = "test-attachment-1"
      + users      = []
        # (2 unchanged attributes hidden)
    }
  # aws_iam_policy_attachment.aws-elasticbeanstalk-ec2-attach-S3 has been changed
  ~ resource "aws_iam_policy_attachment" "aws-elasticbeanstalk-ec2-attach-S3" {
      + groups     = []
        id         = "test-attachment-1"
        name       = "test-attachment-1"
      + users      = []
        # (2 unchanged attributes hidden)
    }
  # aws_iam_role.aws-elasticbeanstalk-ec2-role has been changed
  ~ resource "aws_iam_role" "aws-elasticbeanstalk-ec2-role" {
        id                    = "aws-elasticbeanstalk-ec2-role"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AWSElasticBeanstalkWebTier",
          + "arn:aws:iam::aws:policy/AmazonEC2ReadOnlyAccess",
          + "arn:aws:iam::aws:policy/AmazonS3ReadOnlyAccess",
          + "arn:aws:iam::aws:policy/service-role/AmazonEC2RoleforSSM",
        ]
        name                  = "aws-elasticbeanstalk-ec2-role"
      + tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # aws_iam_policy_attachment.aws-elasticbeanstalk-ec2-attach-SSM has been changed
  ~ resource "aws_iam_policy_attachment" "aws-elasticbeanstalk-ec2-attach-SSM" {
      + groups     = []
        id         = "test-attachment-1"
        name       = "test-attachment-1"
      + users      = []
        # (2 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_elastic_beanstalk_application_version.default will be created
  + resource "aws_elastic_beanstalk_application_version" "default" {
      + application  = "ImageManager"
      + arn          = (known after apply)
      + bucket       = "image-manager-app-file"
      + description  = "application version created by terraform"
      + force_delete = false
      + id           = (known after apply)
      + key          = (known after apply)
      + name         = "ImageManager"
      + tags_all     = (known after apply)
    }

  # aws_s3_bucket_object.bucket-s3-app-war will be created
  + resource "aws_s3_bucket_object" "bucket-s3-app-war" {
      + acl                    = "private"
      + bucket                 = "image-manager-app-file"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "beanstalk/ImageManager_v1.war"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "files/ImageManager_v1.war"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```
</details>
*Pusher: @acolominas, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*